{
  "active_id": "gd_14ba49ce",
  "guides": [
    {
      "id": "gd_14ba49ce",
      "title": null,
      "content": "### Benvenuto in Counselorbot\n\nSono il tuo compagno di apprendimento, qui per aiutarti a esplorare strategie di studio e a comprendere i risultati del QSA. Ricorda che sono uno strumento di supporto: per decisioni importanti, rivolgiti sempre ai tuoi docenti e tutor.\n\n---\n\n### Funzionalità Principali\n\n*   **Invia un messaggio**: Scrivi nel box in basso e premi `Invio`. Per andare a capo senza inviare, usa `Shift+Invio`.\n*   **Registrazione Vocale**: Clicca sull'icona del microfono per dettare il tuo messaggio.\n*   **Interagisci con le Risposte**: Sotto ogni messaggio dell'assistente, trovi delle icone per diverse azioni:\n    *   **Ascolta**: Fai leggere la risposta ad alta voce (icona altoparlante).\n    *   **Copia**: Copia il testo del messaggio (icona fogli).\n    *   **Scarica**: Salva il singolo messaggio come file di testo (icona download).\n    *   **Feedback**: Valuta la risposta con il pollice in su o in giù per aiutarci a migliorare.\n\n---\n\n### Funzionalità Avanzate\n\n*   **Cambia Personalità**: Dal menu a tendina in alto a sinistra, puoi scegliere una personalità diversa per il chatbot. Questo cambia lo stile della conversazione e l'avatar.\n*   **Allega File**: Usa il pulsante a forma di graffetta nell'area di input per caricare documenti (come PDF e TXT). Il chatbot li userà per darti risposte più contestualizzate.\n*   **Analisi delle Fonti**: Sotto alcune risposte, potresti trovare un riquadro **\"Topic e Fonti\"**. Clicca su `Mostra` per scoprire:\n    *   Gli **argomenti** che il chatbot ha identificato nel messaggio.\n    *   I **documenti** che ha consultato per formulare la risposta. Puoi vedere un'anteprima o scaricare la fonte originale.\n\n---\n\n### Gestione delle Conversazioni\n\n*   **Salva le tue Chat**: Effettuando il **Login**, le tue conversazioni vengono salvate in modo sicuro e crittografato, così potrai riprenderle in qualsiasi momento.\n*   **Menu Azioni**: Clicca sull'icona con i **tre puntini** in alto per accedere al menu principale. Da qui puoi:\n    *   Iniziare una **Nuova Conversazione**.\n    *   **Scaricare la conversazione**: puoi salvare l'intera chat in un file di testo (.txt). Il file includerà anche un riassunto della conversazione generato dall'intelligenza artificiale per una rapida consultazione.\n    *   Visualizzare le **Chat Salvate** (che apre la barra laterale con lo storico).\n\n---\n\n### Consigli Utili e Privacy\n\n*   **Sperimenta**: Prova a porre le domande in modi diversi e a usare le varie personalità per scoprire l'approccio che funziona meglio per te.\n*   **Privacy**: Per la tua sicurezza, ti raccomandiamo di non condividere mai informazioni personali sensibili come password, indirizzi email o dati privati."
    }
  ]
}